tutorials/rigidBodyAndBeam/rigidBodyAndBeam_shortTime/0/beam/refLambda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volTensorField;
    location    "2";
    object      refLambda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform (1 0 0 0 1 0 0 0 1);

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (1 0 0 0 1 0 0 0 1);
    }
    right
    {
        type            calculated;
        value           uniform (1 0 0 0 1 0 0 0 1);
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
